#**************************************************************
# This .sdc file is created by Terasic Tool.
# Users are recommended to modify this file to match users logic.
#**************************************************************

#**************************************************************
# Create Clock
#**************************************************************
create_clock -name {CLOCK_50} -period 20.000ns -waveform { 0.000 10.000 } [get_ports {MAX10_CLK1_50}]
create_clock -name {CLOCK_JTAG} -period 40.000ns -waveform { 0.000 20.000 } [get_ports {GPIO[8]}]

# VGA : 640x480@60Hz
#create_clock -period "25.18 MHz" -name clk_vga [get_ports VGA_CLK]
# VGA : 800x600@60Hz
#create_clock -period "40.0 MHz" -name clk_vga [get_ports VGA_CLK]
# VGA : 1024x768@60Hz
#create_clock -period "65.0 MHz" -name clk_vga [get_ports VGA_CLK]
# VGA : 1280x1024@60Hz
# create_clock -period "108.0 MHz" -name clk_vga [get_ports VGA_CLK]

#**************************************************************
# Create Generated Clock
#**************************************************************
create_generated_clock -name {CLOCK_25} -source [get_pins {pll_25_inst|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50/1 -multiply_by 1 -divide_by 2 -master_clock {CLOCK_50} [get_pins {pll_25_inst|altpll_component|auto_generated|pll1|clk[0]}] 



#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************
derive_clock_uncertainty



#**************************************************************
# Set Input Delay
#**************************************************************
set_input_delay -clock CLOCK_25 0.1 [all_inputs]


#**************************************************************
# Set Output Delay
#**************************************************************
set_output_delay -clock CLOCK_25 0.1 [all_outputs]


#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************



#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Load
#**************************************************************



